martinbaillie.org
#+seq_todo: TODO DRAFT DONE
#+property: header-args :eval never-export
#+startup: indent
#+author: Martin Baillie
#+hugo_base_dir: ./

** DONE Tailscale Support for NixOS :nix:tailscale:wireguard:security:
CLOSED: [2020-03-20 Fri 18:24]
:PROPERTIES:
:EXPORT_FILE_NAME: tailscale-support-for-nixos
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :tldr Learn how to configure Tailscale on NixOS.
:END:
I have been [[/wrote/tailscale-support-for-openbsd][continuing]] to run with Tailscale instead of hand-cranked WireGuard
on various devices, including my daily driver ThinkPad which runs my /other/
favourite OS—[[https://nixos.org/][NixOS]]!

However, until now the configuration was not particularly idiomatic due to there
being no upstream Tailscale Nix expressions in [[https://github.com/NixOS/nixpkgs][nixpkgs]].

As it transpired, Dan Anderson of Tailscale is also a NixOS user and with his
support I was able to shepherd in a [[https://github.com/NixOS/nixpkgs/pull/82537][quick PR]] to introduce a Tailscale [[https://search.nixos.org/options?query=tailscale][module]]. I
actually think NixOS ended up being their first Linux flavoured package!

Like the previous OpenBSD post, the rest of this post will walk you through how
to set up Tailscale on NixOS.
*** Installing Tailscale on NixOS
It's simple!
#+BEGIN_SRC nix
services.tailscale.enable = true;

# Optional (default: 41641):
services.tailscale.port = 12345;
#+END_SRC

You can choose to make it easier for Tailscale by opening up the UDP port.
#+BEGIN_SRC nix
networking.firewall.allowedUDPPorts = [ ${services.tailscale.port} ];
#+END_SRC

Depending on your setup, you may need to make the =tailscale= CLI available to
all users.
#+BEGIN_SRC nix
environment.systemPackages = with pkgs; [ tailscale ];
#+END_SRC

That's the configuration out of the way. If you perform a =rebuild-switch=, you
should find a Tailscale daemon running.
#+BEGIN_SRC shell
; systemctl status tailscale
#+END_SRC

Finally, perform an initial authentication for this machine and you're done.
#+BEGIN_SRC shell
; tailscale up
#+END_SRC

You should be able to see a successfully plumbed device, and Tailscale logs
scrolling.
#+BEGIN_SRC shell
; ip link show tailscale0
; journalctl -fu tailscale
#+END_SRC
